MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS505/mcu.h
#define _ADTRIG4L_TRGSRC173_POSITION             0x0000000B
#define _ADTRIG4L_TRGSRC173_MASK                 0x00000800
#define _ADTRIG4L_TRGSRC173_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC174_POSITION             0x0000000C
#define _ADTRIG4L_TRGSRC174_MASK                 0x00001000
#define _ADTRIG4L_TRGSRC174_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC18_POSITION              0x00000000
#define _ADTRIG4H_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG4H_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG4H_TRGSRC19_POSITION              0x00000008
#define _ADTRIG4H_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG4H_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG4H_TRIGSRC180_POSITION            0x00000000
#define _ADTRIG4H_TRIGSRC180_MASK                0x00000001
#define _ADTRIG4H_TRIGSRC180_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC181_POSITION            0x00000001
#define _ADTRIG4H_TRIGSRC181_MASK                0x00000002
#define _ADTRIG4H_TRIGSRC181_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC182_POSITION            0x00000002
#define _ADTRIG4H_TRIGSRC182_MASK                0x00000004
#define _ADTRIG4H_TRIGSRC182_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC183_POSITION            0x00000003
#define _ADTRIG4H_TRIGSRC183_MASK                0x00000008
#define _ADTRIG4H_TRIGSRC183_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC184_POSITION            0x00000004
#define _ADTRIG4H_TRIGSRC184_MASK                0x00000010
#define _ADTRIG4H_TRIGSRC184_LENGTH              0x00000001

#define _ADTRIG4H_TRGSRC190_POSITION             0x00000008
#define _ADTRIG4H_TRGSRC190_MASK                 0x00000100
#define _ADTRIG4H_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC191_POSITION             0x00000009
#define _ADTRIG4H_TRGSRC191_MASK                 0x00000200
#define _ADTRIG4H_TRGSRC191_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC192_POSITION             0x0000000A
#define _ADTRIG4H_TRGSRC192_MASK                 0x00000400
#define _ADTRIG4H_TRGSRC192_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC193_POSITION             0x0000000B
#define _ADTRIG4H_TRGSRC193_MASK                 0x00000800
#define _ADTRIG4H_TRGSRC193_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC194_POSITION             0x0000000C
#define _ADTRIG4H_TRGSRC194_MASK                 0x00001000
#define _ADTRIG4H_TRGSRC194_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC180_POSITION             0x00000000
#define _ADTRIG4H_TRGSRC180_MASK                 0x00000001
#define _ADTRIG4H_TRGSRC180_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC181_POSITION             0x00000001
#define _ADTRIG4H_TRGSRC181_MASK                 0x00000002
#define _ADTRIG4H_TRGSRC181_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC182_POSITION             0x00000002
#define _ADTRIG4H_TRGSRC182_MASK                 0x00000004
#define _ADTRIG4H_TRGSRC182_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC183_POSITION             0x00000003
#define _ADTRIG4H_TRGSRC183_MASK                 0x00000008
#define _ADTRIG4H_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC184_POSITION             0x00000004
#define _ADTRIG4H_TRGSRC184_MASK                 0x00000010
#define _ADTRIG4H_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC20_POSITION              0x00000000
#define _ADTRIG5L_TRGSRC20_MASK                  0x0000001F
#define _ADTRIG5L_TRGSRC20_LENGTH                0x00000005

#define _ADTRIG5L_TRGSRC21_POSITION              0x00000008
#define _ADTRIG5L_TRGSRC21_MASK                  0x00001F00
#define _ADTRIG5L_TRGSRC21_LENGTH                0x00000005

#define _ADTRIG5L_TRIGSRC200_POSITION            0x00000000
#define _ADTRIG5L_TRIGSRC200_MASK                0x00000001
#define _ADTRIG5L_TRIGSRC200_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC201_POSITION            0x00000001
#define _ADTRIG5L_TRIGSRC201_MASK                0x00000002
#define _ADTRIG5L_TRIGSRC201_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC202_POSITION            0x00000002
#define _ADTRIG5L_TRIGSRC202_MASK                0x00000004
#define _ADTRIG5L_TRIGSRC202_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC203_POSITION            0x00000003
#define _ADTRIG5L_TRIGSRC203_MASK                0x00000008
#define _ADTRIG5L_TRIGSRC203_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC204_POSITION            0x00000004
#define _ADTRIG5L_TRIGSRC204_MASK                0x00000010
#define _ADTRIG5L_TRIGSRC204_LENGTH              0x00000001

#define _ADTRIG5L_TRGSRC210_POSITION             0x00000008
#define _ADTRIG5L_TRGSRC210_MASK                 0x00000100
#define _ADTRIG5L_TRGSRC210_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC211_POSITION             0x00000009
#define _ADTRIG5L_TRGSRC211_MASK                 0x00000200
#define _ADTRIG5L_TRGSRC211_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC212_POSITION             0x0000000A
#define _ADTRIG5L_TRGSRC212_MASK                 0x00000400
#define _ADTRIG5L_TRGSRC212_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC213_POSITION             0x0000000B
#define _ADTRIG5L_TRGSRC213_MASK                 0x00000800
#define _ADTRIG5L_TRGSRC213_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC214_POSITION             0x0000000C
#define _ADTRIG5L_TRGSRC214_MASK                 0x00001000
#define _ADTRIG5L_TRGSRC214_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC200_POSITION             0x00000000
#define _ADTRIG5L_TRGSRC200_MASK                 0x00000001
#define _ADTRIG5L_TRGSRC200_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC201_POSITION             0x00000001
#define _ADTRIG5L_TRGSRC201_MASK                 0x00000002
#define _ADTRIG5L_TRGSRC201_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC202_POSITION             0x00000002
#define _ADTRIG5L_TRGSRC202_MASK                 0x00000004
#define _ADTRIG5L_TRGSRC202_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC203_POSITION             0x00000003
#define _ADTRIG5L_TRGSRC203_MASK                 0x00000008
#define _ADTRIG5L_TRGSRC203_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC204_POSITION             0x00000004
#define _ADTRIG5L_TRGSRC204_MASK                 0x00000010
#define _ADTRIG5L_TRGSRC204_LENGTH               0x00000001

